; domain
(define (domain blocksworld)
(:predicates (clear ?x)
             (ontable ?x)
             (on ?x ?y))

(:action move-b-to-b
  :parameters (?bm ?bf ?bt)
  :precondition (and (clear ?bm) (clear ?bt) (on ?bm ?bf))
  :effect (and (not (clear ?bt)) (not (on ?bm ?bf))
               (on ?bm ?bt) (clear ?bf)))

(:action move-b-to-t
  :parameters (?bm ?bf)
  :precondition (and (clear ?bm) (on ?bm ?bf))
  :effect (and (not (on ?bm ?bf))
               (ontable ?bm) (clear ?bf)))

(:action move-t-to-b
  :parameters (?bm ?bt)
  :precondition (and (clear ?bm) (clear ?bt) (ontable ?bm))
  :effect (and (not (clear ?bt)) (not (ontable ?bm))
               (on ?bm ?bt))))

; problem
(define (problem BW-rand-12)
(:domain blocksworld)
(:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 )
(:init
(on b1 b5)
(ontable b2)
(ontable b3)
(on b4 b6)
(on b5 b8)
(on b6 b11)
(ontable b7)
(on b8 b2)
(ontable b9)
(on b10 b12)
(on b11 b3)
(on b12 b7)
(clear b1)
(clear b4)
(clear b9)
(clear b10)
)
(:goal
(and
(on b1 b2)
(on b2 b6)
(on b6 b11)
(on b7 b3)
(on b8 b4)
(on b10 b9)
(on b11 b8)
(on b12 b1))
)
)

; plan
1. (move-b-to-t b1 b5)
   deleted: (on b1 b5)
   added: (ontable b1) (clear b5)
   goals met: 1 of 8
2. (move-b-to-t b5 b8)
   deleted: (on b5 b8)
   added: (ontable b5) (clear b8)
   goals met: 1 of 8
3. (move-b-to-b b4 b6 b5)
   deleted: (clear b5) (on b4 b6)
   added: (on b4 b5) (clear b6)
   goals met: 1 of 8
4. (move-b-to-b b8 b2 b4)
   deleted: (clear b4) (on b8 b2)
   added: (on b8 b4) (clear b2)
   goals met: 2 of 8
5. (move-b-to-b b6 b11 b1)
   deleted: (clear b1) (on b6 b11)
   added: (on b6 b1) (clear b11)
   goals met: 1 of 8
6. (move-b-to-b b10 b12 b9)
   deleted: (clear b9) (on b10 b12)
   added: (on b10 b9) (clear b12)
   goals met: 2 of 8
7. (move-b-to-b b11 b3 b8)
   deleted: (clear b8) (on b11 b3)
   added: (on b11 b8) (clear b3)
   goals met: 3 of 8
8. (move-b-to-b b6 b1 b11)
   deleted: (clear b11) (on b6 b1)
   added: (on b6 b11) (clear b1)
   goals met: 4 of 8
9. (move-t-to-b b2 b6)
   deleted: (clear b6) (ontable b2)
   added: (on b2 b6)
   goals met: 5 of 8
10. (move-t-to-b b1 b2)
   deleted: (clear b2) (ontable b1)
   added: (on b1 b2)
   goals met: 6 of 8
11. (move-b-to-b b12 b7 b1)
   deleted: (clear b1) (on b12 b7)
   added: (on b12 b1) (clear b7)
   goals met: 7 of 8
12. (move-t-to-b b7 b3)
   deleted: (clear b3) (ontable b7)
   added: (on b7 b3)
   goals met: 8 of 8
